hurrican/wbci-acceptance-test/src/citrus/resources/de/mnet/wbci/acceptance/elektra/cdm/v1/ElektraService_03/VA_KUEORN_ABG.xml

<?xml version='1.0' encoding='UTF-8'?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
    <SOAP-ENV:Header/>
    <SOAP-ENV:Body>
        <v1:requestCarrierChange xmlns:v1="http://www.mnet.de/esb/cdm/SupplierPartner/CarrierNegotiationService/v1">
            <v1:VA-KUE-ORN>
                <v1:absender>
                    <v1:carrierCode>${carrierCodeAuf}</v1:carrierCode>
                </v1:absender>
                <v1:empfaenger>
                    <v1:carrierCode>${carrierCodeAbg}</v1:carrierCode>
                </v1:empfaenger>
                <v1:version>0</v1:version>
                <v1:endkundenvertragspartner>
                    <v1:EKPauf>
                        <v1:carrierCode>${carrierCodeAuf}</v1:carrierCode>
                    </v1:EKPauf>
                    <v1:EKPabg>
                        <v1:carrierCode>${carrierCodeAbg}</v1:carrierCode>
                    </v1:EKPabg>
                </v1:endkundenvertragspartner>
                <v1:vorabstimmungsId>${preAgreementId}</v1:vorabstimmungsId>
                <v1:kundenwunschtermin>${requestedCustomerDate}</v1:kundenwunschtermin>
                <v1:endkunde>
                    <v1:person>
                        <v1:anrede>1</v1:anrede>
                        <v1:vorname>John</v1:vorname>
                        <v1:nachname>McFly</v1:nachname>
                    </v1:person>
                </v1:endkunde>
                <v1:weitereAnschlussinhaber>
                    <v1:person>
                        <v1:anrede>2</v1:anrede>
                        <v1:vorname>Kate</v1:vorname>
                        <v1:nachname>McFly</v1:nachname>
                    </v1:person>
                </v1:weitereAnschlussinhaber>
                <v1:projektId>
                    <v1:projektkenner>${wbciSimulatorUseCase}</v1:projektkenner>
                </v1:projektId>
                <v1:standort>
                    <v1:strasse>
                        <v1:strassenname>Emmy-Noether-Straße</v1:strassenname>
                        <v1:hausnummer>2</v1:hausnummer>
                        <v1:hausnummernZusatz>a</v1:hausnummernZusatz>
                    </v1:strasse>
                    <v1:postleitzahl>80992</v1:postleitzahl>
                    <v1:ort>München</v1:ort>
                </v1:standort>
                <v1:anschlussidentifikation>
                    <v1:ONKZ>89</v1:ONKZ>
                    <v1:rufnummer>111111111</v1:rufnummer>
                </v1:anschlussidentifikation>
            </v1:VA-KUE-ORN>
        </v1:requestCarrierChange>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>